<!DOCTYPE html>
<html>
	<head>
		<title>La zorra y las uvas</title>
		<link href="img/Sect_symbol2.jpg" rel="icon" >
		<style type="text/css">
		body {background-color: white; color: black}
		#wrapper{background-color: white; /*width: 1200px;*/ float: center}
		#news{font-family: courier; text-align:left; margin-left: 16%; margin-right: 16%}
		div.marco{border: 2px solid black; border-radius: 3px; padding-left: 5%; padding-right: 5%; padding-bottom: 2%; margin-bottom: 2%}
		h2 {color:black;text-align:center}
		h4 {color: green; margin-left: 80px}
		li {color: black}
		p {color: black; margin-right: 32px}
		tr, td {padding: 2px}
		input, select {border-radius: 3px; color: black; font-family: verdana; background-color: white}
		option {color: black}
		iframe {border: none; padding: 0px}
		</style>
	</head>
	<body style="font-family:verdana" align="center">
		<br/>
		<div id="wrapper">
			<div align="center">
				<img src="img/Titulito.png">
			</div>
			<br/>
			<div id="news">
				<div class="marco">
					<h3>Weaver: un problema de combinatoria</h3>
					<p>La aplicaci&oacute;n para cacharros de Android "Weaver" plantea un puzle en apariencia sencillo, que se complica si queremos hallar la forma m&aacute;s eficiente de resolverlo. No obstante, hay una <a href="http://math.stackexchange.com/questions/1201676/the-weaver-android-app-rightarrow-cute-combinatorics-problem" >soluci&oacute;n elegante</a> a este problema. Por alg&uacute;n motivo, aq&iacute; les dejamos una versi&oacute;n de navegador de este juego, que s&oacute;lo supera al original en n&uacute;mero de colorines.</p>
					<a href="http://gonthalo.github.io/Weaver"><div width="100%" align="center" style="border-radius:4px"><img align="center" src="https://cloud.githubusercontent.com/assets/5852184/11614533/cf41bc82-9c45-11e5-8a67-a9aad0dde320.png"></div></a>
				</div>
				<div class="marco">
					<h3>Conjunto de Mandelbrot: El fractal m&aacute;s conocido y del que m&aacute;s se desconoce</h3>
					<p>En homenaje a uno de los grandes matem&aacute;ticos del siglo XX, no hemos podido sino plasmar aqu&iacute; su obra magna: el conjunto que lleva su nombre. Si no puede usted verlo, o bien carece de la fe necesaria, o su navegador no se lleva bien con Javascript.</p>
					<iframe style="border:none" width="100%" height="600px" src="http://gonthalo.github.io/Mandelbrot-Set/"></iframe>
				</div>
				<div class="marco">
					<h3>El problema de la autopista: Un algoritmo para resolver un problema de grafos.</h3>
					<p>Dados <i>n</i> puntos en el plano, ¿Cu&aacute;l es la mejor forma de elegir <i>m</i> conexiones entre ellos para minimizar la distancia promedio entre dos de ellos? Para responder a esta pregunta, hemos creado un maravilloso programa en Javascript que utiliza el algoritmo de Dikjistra y la triangulaci&oacute;n de Delaunay para encontrar esa combinaci&oacute;n de conexiones lo m&aacute;s r&aacute;pidamente posible.</p>
					<iframe src="http://gonthalo.github.io/Motorway-Problem" width="100%" height="450"></iframe>
					<a href="http://gonthalo.github.io/Motorway-Problem"><div width="100%" align="center" style="background-color:white; border-radius:4px"><img align="center" src="img/Motorway.png"></div></a>
				</div>
				<div class="marco">
					<h3>POING (Particula Operativa In Nomine Gauss)</h3>
					<p>Podr&iacute;a entenderse como un juego, como una simulaci&oacute;n o como un intento de visualizar los movimientos que sufren diversas part&iacute;culas ante fuerzas subat&oacute;micas. No es nada de lo anterior. Se trata m&aacute;s bien de filosof&iacute;a en estado puro. Dejemos que las reglas sin sentido del mundo cobren significado en nuestras cabecitas.</p>
					<a href="http://gonthalo.github.io/POING"><div width="100%" align="center" style="border-radius:4px"><img align="center" src="img/PoingImg.png"></div></a>
				</div>
				<div class="marco">
					<h3>La Otra Qu&iacute;mica: Un esperpento del formalismo presente en esta ciencia menor</h3>
					<p>En efecto. No ha bastado que las interminables clases tocaran a su fin para que la qu&iacute;mica recobrara la escasa dignidad que tuviera alguna vez. Sin temor a crear controversia o a parecer idiotas, les proporcionamos un medio para reirse descaradamente de los qu&iacute;micos y sus andanzas.</p>
					<p>Algunas de las sat&iacute;ricas publicaciones que ya pueden consultarse aqu&iacute; son la hisstoria-ficci&oacute;n del famoso Clapeyrond y los dos primeros y exaltantes cap&iacute;tulos del programa de televisi&oacute;n MasterChem.</p>
					<a href="http://gonthalo.github.io/Gallinas"><div width="100%" align="center" style="background-color:white; border-radius:4px"><img align="center" src="img/Título3.png"></div></a>
				</div>
				<div class="marco">
					<h3>Delirios: Anaquel de relatos aleg&oacute;ricos</h3>
					<p>¿Qu&eacute; pensamientos se esconden en lo m&aacute;s profundo de la mente? ¿Qu&eacute; se mueve allende no podemos captar su naturaleza? ¿Acaso son esos impulsos, impresiones, recuerdos y asociaciones los que rigen nuestro comportamiento? Bueno, como eso nos da exactamente igual, hoy vamos a mostrarles un conjunto finito pero innumerable de cuentos que pueden resultar interesantes. S&iacute;, s&iacute;, muy interesantes.</p>
					<p>Por cierto, si es usted un fil&oacute;sofo, artista, matem&aacute;tico o incauto de otro tipo que no se conforma con lo que hay y decide darle muchas vueltas a lo mismo una y otra vez, todo el rato, de nuevo, etc... Hemos de advertirle que si trata de indagar en la teleolog&iacute;a de aquesta obra, su cabeza podr&iacute;a deshacerse en l&aacute;grimas. Si desea usted buscar cosas donde no las hay, busque un "generador de puntos aleatorios" en internet y trate de adivinar qu&eacute; constelaci&oacute;n es. Desde luego, NO estamos dispuestos a escuchar sus dudas si mandan un correo a la direcci&oacute;n z123711194367163i@gmail.com.</p>
					<a href="http://gonthalo.github.io/Delirios.pdf">Texto completo.</a>
				</div>
			</div>
			<br/>
		</div>
	</body>
	<script type="text/javascript" src="script.js"></script>
<html>
